In [1]:
import sqlite3

conn = sqlite3.connect('chuong_1.db')

cursor = conn.cursor()

In [ ]:
#Tạo một bảng có tên NhanVien
cursor.execute('''CREATE TABLE NhanVien(
                MaNV INT PRIMARY KEY,
                HoTen VarChar(50),
                Tuoi INT,
                PhongBan INT
               )''')

In [ ]:
#Chèn bản ghi vào bảng NhanVien
cursor.execute("""INSERT INTO NhanVien (MaNV, HoTen, Tuoi, PhongBan) VALUES
                (1, 'Nguyen Van A', 30, 'Ke Toan'),
                (2, 'Tran Thi B', 25, 'Nhan Su'),
                (3, 'Le Van C', 28, 'IT'),
                (4, 'Pham Thi D', 32, 'Ke Toan'),
                (5, 'Vu Van E', 26, 'IT'),
                (6, 'Nguyen Thi F', 29, 'Marketing'),
                (7, 'Le Thi G', 27, 'Nhan Su'),
                (8, 'Hoang Van H', 35, 'Ke Toan'),
                (9, 'Pham Van I', 33, 'Marketing'),
                (10, 'Tran Van J', 24, 'IT'),
                (11, 'Dang Thi K', 31, 'Nhan Su'),
                (12, 'Nguyen Van L', 28, 'Ke Toan'),
                (13, 'Tran Thi M', 26, 'Marketing'),
                (14, 'Pham Van N', 30, 'Nhan Su'),
                (15, 'Hoang Thi O', 27, 'IT')
               ;""")
conn.commit()

In [2]:
#Lấy toàn bộ thông tin của nhân viên trong bảng NhanVien
cursor.execute("SELECT * FROM NhanVien")
cursor.fetchall()

[(1, 'Nguyen Van A', 30, 'Ke Toan'),
 (2, 'Tran Thi B', 25, 'Nhan Su'),
 (3, 'Le Van C', 28, 'IT'),
 (4, 'Pham Thi D', 32, 'Ke Toan'),
 (5, 'Vu Van E', 26, 'IT'),
 (6, 'Nguyen Thi F', 29, 'Marketing'),
 (7, 'Le Thi G', 27, 'Nhan Su'),
 (8, 'Hoang Van H', 35, 'Ke Toan'),
 (9, 'Pham Van I', 33, 'Marketing'),
 (10, 'Tran Van J', 24, 'IT'),
 (11, 'Dang Thi K', 31, 'Nhan Su'),
 (12, 'Nguyen Van L', 28, 'Ke Toan'),
 (13, 'Tran Thi M', 26, 'Marketing'),
 (14, 'Pham Van N', 30, 'Nhan Su'),
 (15, 'Hoang Thi O', 27, 'IT')]

In [3]:
#Truy vấn HoTen và Tuoi của các nhân viên trong phòng IT
cursor.execute("SELECT HoTen, Tuoi FROM NhanVien WHERE PhongBan = 'IT'")
cursor.fetchall()

[('Le Van C', 28), ('Vu Van E', 26), ('Tran Van J', 24), ('Hoang Thi O', 27)]

In [4]:
#Tìm nhân viên có tuổi lớn hơn 25
cursor.execute("SELECT * FROM NhanVien WHERE Tuoi > 25")
cursor.fetchall()

[(1, 'Nguyen Van A', 30, 'Ke Toan'),
 (3, 'Le Van C', 28, 'IT'),
 (4, 'Pham Thi D', 32, 'Ke Toan'),
 (5, 'Vu Van E', 26, 'IT'),
 (6, 'Nguyen Thi F', 29, 'Marketing'),
 (7, 'Le Thi G', 27, 'Nhan Su'),
 (8, 'Hoang Van H', 35, 'Ke Toan'),
 (9, 'Pham Van I', 33, 'Marketing'),
 (11, 'Dang Thi K', 31, 'Nhan Su'),
 (12, 'Nguyen Van L', 28, 'Ke Toan'),
 (13, 'Tran Thi M', 26, 'Marketing'),
 (14, 'Pham Van N', 30, 'Nhan Su'),
 (15, 'Hoang Thi O', 27, 'IT')]

In [5]:
#Cho biết nhân viên lớn tuổi nhất các PhongBan
cursor.execute("SELECT PhongBan, HoTen ,MAX(Tuoi) FROM NhanVien GROUP BY PhongBan")
cursor.fetchall()

[('IT', 'Le Van C', 28),
 ('Ke Toan', 'Hoang Van H', 35),
 ('Marketing', 'Pham Van I', 33),
 ('Nhan Su', 'Dang Thi K', 31)]

In [ ]:
#Chuyển đổi thông tin PhongBan của nhân viên “Le Van C” sang “Marketing” 
cursor.execute("UPDATE NhanVien SET PhongBan = 'Marketing' WHERE HoTen = 'Le Van C'")
conn.commit()
cursor.execute("SELECT * FROM NhanVien WHERE HoTen = 'Le Van C'")
cursor.fetchall()

[(3, 'Le Van C', 28, 'Marketing')]

In [7]:
#Xoá nhân viên có MaNV = '2' rồi cho biết mỗi phòng ban có bao nhiêu người.
cursor.execute("DELETE FROM NhanVien WHERE MaNV = 2")
cursor.execute("SELECT PhongBan, COUNT(*) FROM NhanVien GROUP BY PhongBan")
cursor.fetchall()

[('IT', 3), ('Ke Toan', 4), ('Marketing', 4), ('Nhan Su', 3)]

In [8]:
conn.close()